Tekla Open API Reference for Tekla Structures 2025
ImageListComboBox.RefreshOptionList Method
 Refreshes the option list content.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RefreshOptionList()
Public Sub RefreshOptionList
Examples
 The following example demonstrates how to programmatically add a new item to the combo box:
using System;
using System.Drawing;
using System.Windows.Forms;
using Tekla.Structures.Dialog.UIControls;
public class ImageListComboBoxExample
{
    private ImageListComboBox ImageListComboBox;
    public ImageListComboBoxExample()
    {
        ImageListComboBox = new ImageListComboBox();
    }
    void AddNewImage()
    {
        ImageListComboBox.ImageList.Images.Add("ImageKey", new Bitmap(@"C:\Image.bmp"));
        ImageListComboBox.RefreshOptionList();
    }
}
See Also
Reference
ImageListComboBox Class
Tekla.Structures.Dialog.UIControls Namespace